-- Let us take care of exercises related to filtering and aggregations using SQL.
-- * Get all the details of the courses which are in `inactive` or `draft` state.
-- * Get all the details of the courses which are related to `Python` or `Scala`.
-- * Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.
-- * Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.
-- * Get all the details of `Python` or `Scala` related courses in `draft` status.
-- * Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

In [5]:
%load_ext sql

In [6]:
%load_ext sql
%sql mysql+mysqlconnector://root:*********@localhost/retail_db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:

%config sqlmagic.style = 'plain_columns'

In [8]:
%%sql

select distinct(table_name)
from information_schema.columns
where table_schema = "retail_db"

 * mysql+mysqlconnector://root:***@localhost/retail_db
8 rows affected.

[('categories',),
 ('courses',),
 ('customers',),
 ('departments',),
 ('order_items',),
 ('orders',),
 ('products',),
 ('test',)]

In [15]:
%%sql
select *
from courses 
order by course_status desc

 * mysql+mysqlconnector://root:***@localhost/retail_db
12 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23)),
 (12, 'Server Automation - Ansible', 'Uncle Sam', 'published', datetime.date(2020, 7, 5)),
 (5, 'Programming using Java', 'Mike Jack', 'inactive', datetime.date(2020, 8, 10)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (10, 'Web Applications - Scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (7, 'Web Applications - Java Spring', 'Bob Dillon', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None)]

- * Get all the details of the courses which are in `inactive` or `draft` state.

In [27]:
%%sql

select * from courses
where course_status in("inactive" , "draft")
order by course_status

 * mysql+mysqlconnector://root:***@localhost/retail_db
6 rows affected.

[(3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (7, 'Web Applications - Java Spring', 'Bob Dillon', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None),
 (5, 'Programming using Java', 'Mike Jack', 'inactive', datetime.date(2020, 8, 10)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (10, 'Web Applications - Scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30))]

* Get all the details of the courses which are related to `Python` or `Scala`.

In [31]:
%%sql

select * from courses
where course_name like "%Python%" or course_name like "%Scala%"

 * mysql+mysqlconnector://root:***@localhost/retail_db
9 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (10, 'Web Applications - Scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23))]

* Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.

In [35]:
%%sql

select course_status,
count(course_status) as course_count
from courses
group by course_status

 * mysql+mysqlconnector://root:***@localhost/retail_db
3 rows affected.

[('published', 6), ('draft', 3), ('inactive', 3)]

-- * Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.

In [36]:
%%sql

select course_author,
    count(course_status)
    from courses
where course_status = "published"
group by course_author

 * mysql+mysqlconnector://root:***@localhost/retail_db
3 rows affected.

[('Bob Dillon', 4), ('Elvis Presley', 1), ('Uncle Sam', 1)]

-- * Get all the details of `Python` or `Scala` related courses in `draft` status.

In [42]:
%%sql

select * from courses
where (course_name like "%python%" or course_name LIKE "%scala%")
    and course_status = "draft"

 * mysql+mysqlconnector://root:***@localhost/retail_db
2 rows affected.

[(3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None)]

-- * Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

In [48]:
%%sql

select course_author,
        count(*) as course_count
from courses
where course_status = "published"
group by 1
    having count(*) > 1

 * mysql+mysqlconnector://root:***@localhost/retail_db
1 rows affected.

[('Bob Dillon', 4)]